read_verilog -I./ -I../common -sv ../cpu/cpu.sv ../alu/alu.sv ./soc_fpga.sv ../common/memory.sv;
hierarchy -check;
proc;
opt;
fsm;
opt;
synth_ice40 -top soc_fpga;
stat;